#include <iostream>
#include <cmath>
using namespace std;

int main()
{
	/* 12. ористувач вводить число ≥ ваша задача вивести це число по цифрам, т≥льки вже не в оберненому вигл€д≥.
	“обто €кщо користувач введе 1889, то на екран≥ маЇ бути 1889. ƒл€ цього вам треба буде порахувати спочатку
	ск≥льки Ї цифр в числ≥, а пот≥м число д≥лити на 10 в певн≥й степен≥. якщо не розум≥Їте, чому, то спробуйте
	сам≥ вир≥шити цю задачу. ўоб швидко п≥днести число до €когось степеню, напиш≥ть на початку файлу код
	#include <cmath> - це п≥дключить вам математичну б≥бл≥отеку, в €к≥й Ї функц≥€ п≥днесенн€ до степеню. ўоб нею
	скористатись, напиш≥ть pow(число, степ≥нь). ÷€ функц≥€ на м≥сце свого виклику поверне готовий результат.
	Ќаприклад cout << pow(2, 3); виведе на екран 8. як≥ цикли вибирати Ц вир≥шуЇте ви.*/

	int number;
	cout << "Enter number: ";
	cin >> number;

	int temp = number;
	int digits = 0;

	do
	{
		digits++;
		temp /= 10;
	} while (temp != 0);

	for (int i = digits; i > 0; i--)
	{
		cout << number / int(pow(10, i - 1)) % 10;
	}
	cout << endl;
}