#include <iostream>
using namespace std;

//До цього моменту ми у функції надсилали лише змінні (можна було надсилати і константи).
//А масиви надсилати можна? Як це робити?

//Щоб функція могла прийняти масив, треба в їй задати такий параметр.
//Синтаксис: Тип_Данних Ім'я_Масиву[]

//Створимо спочатку прототипи
void Show(int arr[]); //перший варіант: З указанням імені (не обов'язково)
void Show2(int[]);    //другий варіант: ідентичний до першого, тільки без імені

int main()
{
	system("pause");
	return 0;
}

//А тепер спробуємо описати ці функції
void Show(int arr[]) //в описі ім'я вказувати ОБОВ'ЯЗКОВО
{
	for (int i = 0; i </*А яке тут число писати?*/; i++)
	{
		cout << arr[i] << " ";
	}
}

//Пояснення:
//Ми бачимо, що функція, яка приймає масив, нічого не знає про його кількість елементів.
//Це заважає нам написати універсальну функцію. Да, ми можемо там написати стале число, 
//наприклад 5, але що буде якщо викликати функцію, надсилаючи туди масив із 10 елементів? А з 2?
//Тому якщо ви пишете функцію, яка приймає масив, треба надсилати не тільки його, але й кількість елементів.
