#include <iostream>
using namespace std;

int main()
{
	// Ви навчились виводити на екран інформацію. Залишилось навчитись вводити інформацію з клавіатури в програму.
	// Наприклад стоїть задача: ввести з клавіатури свій вік і вивести його на екран. Якщо вам треба зберігати інформацію,
	// треба створити змінну:
	int userAge;

	// Правило №7: старайтесь застосовувати інтерфейс взаємодії з користувачем. Ви пишете програми не для себе а для користувача.
	//             Старайтесь бачити програми не тільки зі сторони програміста, а й зі сторони користувача. Тому добавимо інтерфейс:
	cout << "Enter your age: ";

	// Для того, щоб вводити інформацію з клавіатури, існує інструмент cin (сі ін).
	// Синтаксис введення інформації з клавіатури:
	// cin >> Ім'я_Змінної;
	cin >> userAge; // на цьому моменті виконання програми буде мігати каретка "_" чекаючи поки користувач не введе значення
	                // і не натисне Enter. Після цього його значення запишеться в змінну userAge.

	cout << "Your age = " << userAge << endl;

	// Зауваження: не можна вводити інформацію в константи, бо це порушує їх роль.
	const int CONST = 5;
	cin >> CONST; // помилка на етапі компіляції

	// Ви можете вводити зразу декілька значень ось так:
	int a, b;

	// 1 варіант (довший)
	cin >> a;
	cin >> b;

	// 2 варіант (зручніший)
	cin >> a >> b;

	return 0;
}