#include <iostream>
using namespace std;

int main()
{
	// Ћ≥терал - це ф≥ксоване значенн€, €ке програма не може зм≥нити.

	// ѕриклади:
	// 1, 8, 0, -123, 1000 - ц≥лочисельний л≥терал типу int
	int a = 1; // навед≥ть мишкою на "1" ≥ ви побачите що в≥н маЇ тип int.

	// якщо до ц≥лочисельного л≥тералу добавити суф≥кс "L" або "l" - тип зм≥нитьс€ на long
	long b = 8L;

	// якщо до ц≥лочисельного л≥тералу добавити суф≥кс "LL" або "ll" - тип зм≥нитьс€ на long long
	long long c = 1000000LL;

	// якщо до ц≥лочисельного л≥тералу добавити суф≥кс "U" або "u" - до типу добавитьс€ специф≥катор unsigned
	unsigned int d = 1U;
	unsigned long e = 2UL;
	unsigned long long f = 3ULL;

	// «ј”¬ј∆≈ЌЌя: дл€ типу short суф≥кса не ≥снуЇ, бо любий л≥терал типу short у виразах перетворюЇтьс€ в int.

	// 1.2, 3.444, 12341.12312 - дробовий л≥терал типу double
	double g = 1.2;  // навед≥ть мишкою на "1.2" ≥ ви побачите що в≥н маЇ тип double.

	// якщо до дробового л≥тералу добавити суф≥кс "F" або "f" - тип зм≥нитьс€ на float
	float h = 3.444F;

	// якщо до дробового л≥тералу добавити суф≥кс "L" або "l" - тип зм≥нитьс€ на long double
	long double i = 12341.12312L;

	// '1', 'G', '#', '!', 'z' - символьний л≥терал типу char.
	// «ј”¬ј∆≈ЌЌя: вс≥ символьн≥ л≥терали берутьс€ в одинарн≥ лапки!
	char j = '1';
	char k = #; // помилка, бо символ "#" не в одинарних лапках

	// якщо до символьного л≥тералу добавити ѕ–≈‘≤ — "L" - тип зм≥нитьс€ на wchar_t
	wchar_t l = L'G';

	// якщо до символьного л≥тералу добавити ѕ–≈‘≤ — "u" - тип зм≥нитьс€ на char16_t
	char16_t m = u'$';

	// якщо до символьного л≥тералу добавити ѕ–≈‘≤ — "U" - тип зм≥нитьс€ на char32_t
	char32_t n = U'%';

	// true, false - лог≥чний л≥терал типу bool. true - те саме що ≥ 1. false - те саме що ≥ 0.
	bool o = true;
	bool p = false;

	// "Hello", "My name is", "Emmm..." - р€дковий л≥терал типу const char[]
	cout << "Hello"; // навед≥ть мишкою на "Hello" ≥ побачите тип.

	// ўоб в р€дкових л≥тералах зм≥нити тип char на wchar_t/char16_t/char32_t, треба добавити т≥ сам≥ преф≥кси,
	// що й дл€ символ≥в.

	// cout вм≥Ї виводити текст (тепер ви знаЇте що це р€дковий л≥терал) ≥ люб≥ ≥нш≥ л≥терали. “акож процесор може њх рахувати.
	cout << "My age is: " << 22 << endl;
	cout << "My weight is: " << 72.5 << endl;
	cout << "How looks true: " << true << endl; // на екран≥ 1
	cout << "And false: " << false << endl;     // на екран≥ 0
	cout << "2 + 3 = " << 2 + 3 << endl;        // на екран≥ 5

	return 0;
}