#include <iostream>
using namespace std;

//В мові С++ при передачі значень у функцію їх можна передавати по ЗНАЧЕННЮ і по ПОСИЛАННЮ
//З посиланнями ми скоро зустрінемось, зараз же розглянемо передачу по значенню.

//Створимо прототип функції, яка міняє значення змінних місцями (звичайне правило трьох стаканів)
void Reverse(int, int); 

int main()
{
	setlocale(LC_ALL, "rus"); //підключення російської мови

	//Ініціалізуємо дві змінні, і виведемо їх на екран
	int number1 = 10, number2 = 20;
	cout << "Находимся у функции main()\n";
	cout << "number1 = " << number1 << endl;
	cout << "number2 = " << number2 << endl;

	//Спробуємо поміняти значення змінних місцями (переходьте до рядка 46)
	Reverse(number1, number2);

	//Заново виведемо змінні на екран
	cout << "Находимся у функции main()\n";
	cout << "number1 = " << number1 << endl;
	cout << "number2 = " << number2 << endl;

	//Опа. Значення змінних не помінялись у функції main, хоча у функції Reverse
	//ніби все було добре. В чому біда? Діло в тому, що ми при виклику функції Reverse передаємо
	//ЛИШЕ значення змінних. Представте, що ви питаєте моє ім'я, щоб заповнити анкету. Я вам його скажу
	//і ви запишете його не так. Це ж не означає, що моє ім'я буде тепер іншим, правда? Тут те саме.
	//В рядку 21 ми просто передаємо числа 10 і 20 (ніяких змінних!). В рядку 37 функція створить
	//свої ВЛАСНІ дві змінні (замітьте, у них навіть імена схожі) і надасть їм значення 10 і 20.
	//Чому не виникає помилки, коли створюються змінні з однаковим іменем, ви дізнаєтесь в проекті №7.
	//Функція ДІЙСНО змінює значення СВОЇХ двох змінних місцями. Виводить їх двічі на екран і закінчує
	//свою роботу. При її закінченні ВСІ змінні, які були створенні в ній - знищуються. Програма переходить
	//назад до функції main, і працює уже з її змінними (які змінені не були). От це і називається передача
	//по значенню.

	//Щоб значення, які ми надсилаємо у функції, дійсно змінювались, треба використовувати вказівники або посилання.
	//З обома цими речами ми познайомимось на наступних заняттях.

	system("pause");
	return 0;
}
void Reverse(int number1, int number2)
{
	cout << "Находимся у функции Reverse()\n";
	cout << "Числа до замены: " << endl;
	cout << "number1 = " << number1 << endl;
	cout << "b = " << number2 << endl;

	//Правило трьох стаканів
	int temp;
	temp = number1;
	number1 = number2;
	number2 = temp;

	cout << "Числа после замены:\n";
	cout << "number1 = " << number1 << endl;
	cout << "number2 = " << number2 << endl;
}