#include <iostream>
using namespace std;

int main()
{
	// Є наступна задача: користувач має ввести число 5 разів. Як ви це зробите через
	// одну змінну? Ось так?
	int number;
	cout << "Enter 5 times a number: ";
	cin >> number >> number >> number >> number >> number;

	// Окей, а якщо треба буде 20 разів, то код стане не дуже гарним. Окей, модернізуємо
	// задачу. Користувач вводить число і воно виводиться на екран.
	cout << "Enter 5 times a number: ";
	cin >> number;
	cout << "Your number " << number << endl;
	cin >> number;
	cout << "Your number " << number << endl;
	cin >> number;
	cout << "Your number " << number << endl;
	cin >> number;
	cout << "Your number " << number << endl;
	cin >> number;
	cout << "Your number " << number << endl;

	// І тут настає тупік: а якщо користувач має вказати кількість вводу?
	// Ви чисто фізично не зможете міняти код під час виконання програми. Нам треба цикли.

	// Цикл в програмуванні - це конструкція, яка виконує дію, ПОКИ вірна її умова.
	// Цикли в програмуванні дуже схожі на оператор if, тільки різниця між ними
	// в тому що якщо умова if вірна, то дія if виконується ЛИШЕ раз, а в циклах
	// вона буде виконуватись постійно, поки умова не стане брехливою.

	// В мові С++ є 3 види циклів: while, do while, for. Останній розберемо на наступній парі.

	// Синтаксис створення циклу while:
	/*
	while (умова)
	{
		Дія
	}
	*/

	// Синтаксис дуже схожий на if, але робота циклу відрізняється. СПОЧАТКУ перевіряється
	// умова циклу. Якщо вона НЕ вірна, дія не відбувається і виконання програми іде далі.
	// Якщо умова ПРАВДИВА, то виконується дія і умова після цього ЗНОВУ перевіряється.
	// І так постійно, поки умова не стане БРЕХЛИВОЮ.

	// Спробуємо крок за кроком вирішити нашу задачу: користувач вводить кількість введень,
	// а потім вводить число цю кількість разів.

	int count;
	int userNumber;

	cout << "Enter count: ";
	cin >> count;

	while (count > 0)
	{
		cout << "Enter your number: ";
		cin >> number;
	}

	// Код в циклі можна прочитати так: ПОКИ кількість більша за 0, вводити значення з клавіатури.
	// Але цей цикл буде постійно працювати (інакше буде ВІЧНИМ), тому що умова завжди буде
	// правдива (якщо користувач не ввів від'ємну кількість спочатку). Щоб зробити умову
	// брехливою, з кожним разом треба зменшувати кількість на 1. Ось рішення:
	while (count > 0)
	{
		cout << "Enter your number: ";
		cin >> number;
		count--;
	}

	// Якщо користувач введе кількість 3, то дія спрацює 3 рази (3 > 0, 2 > 0, 1 > 0).
	// Коли використовувати цикл? Коли вам треба виконати якусь дію певну кількість разів.

	// Зауваження №1: в умові циклу може бути абсолютно любий вираз, як і в операторі if.
	// Зауваження №2: любий цикл, як і оператор if, вимагає лише один оператор, тому якщо
	//                ваша дія циклу складається з одного рядка (крапки з комою), то фігурні
	//                дужки можна не ставити

	return 0;
}