#include <iostream>
using namespace std;

int main()
{
	/*17.	Вивести на екран календар ТЕПЕРІШНЬОГО місяця (причому якщо місяць починається наприклад не з понеділка
	а з середи, то перші дві комірки пропустити). Тобто на екран має виглядати така табличка, як і у ваших календарях.
	Тобто наприклад якщо це листопад 2018 року, і для нього має виглядати табличка ось так:

	Пн	Вт	Ср	Чт	Пт	Сб	Нд
		1	2	3	4
		5	6	7	8	9	10	11
		12	13	14	15	16	17	18
		19	20	21	22	23	24	25
		26	27	28	29	30    */

	int firstDay = 6, weekDay;

	cout << "     June 2019 \n\n";
	cout << " Mn  Ts  Wd  Th  Fr  St  Sn\n\n";

	for (int day = 1, weekDay = 1; day <= 30; day++)
	{
		if (day == 1 && weekDay < firstDay)
		{
			cout << "    ";
			day--;
		}
		else
		{
			cout << " ";
			if (day < 10)
			{
				cout << " ";
			}
			cout << day << " ";
		}

		if (++weekDay > 7)
		{
			weekDay = 1;
			cout << "\n\n";
		}
	}
}